tap "cjbassi/ytop"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jesseduffield/lazygit"
# Arduino command-line interface
brew "arduino-cli"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# A TUI system monitor written in Rust
brew "cjbassi/ytop/ytop"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Open-source electronics prototyping platform
cask "arduino"
# Voice and text chat software
cask "discord"
# Design app
cask "figma"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
